/******************************************************************************
 *  ファイル名： rho.c
 * 　 作成日時： 2015/11/21
 * 　　　 機能： ポラード・ロー素因数分解法
 ******************************************************************************/

/******************************************************************************
 * ヘッダファイル
 ******************************************************************************/
#include <stdlib.h>
#include "rho.h"

static unsigned long rho_f(unsigned long x, unsigned long n);
/******************************************************************************
 * 最大公約数演算関数
 ******************************************************************************/
unsigned long gcd(unsigned long x, unsigned long y){
    if (y == 0) return x;
    else return gcd(y, x % y);
}

/******************************************************************************
 * ポラード・ロー素因数分解法演算関数
 ******************************************************************************/
void rho_method(unsigned long n, unsigned long *result){
    unsigned long a, b;
    unsigned long p = 1;
    a = b = 2;
    
    while(p == 1){
        a = rho_f(a, n);
        b = rho_f(rho_f(b, n), n);
        p = gcd(n, labs(b - a));
    }
    if (p == n){        /* 失敗時は0を返す */
        result[0] = 0;
        result[1] = 0;
    } else {
        result[0] = p;
        result[1] = n / p; 
    }
}

static unsigned long rho_f(unsigned long x, unsigned long n){
    return (x * x + 1) % n;
}